app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
---
            <div class="panel-body" style="text-align: center;">
              <% if order.orders.first%>