app/controllers/orders_controller.rb

  def index
    # @orders = Order.all
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders"

  def show

    @Order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]