app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
  def index
    # shop geolocation set-up

    if params[:address] != ""
      @shops = Shop.near(params[:address], 0.5)
    else
      @shops = Shop.where.not(latitude: nil, longitude: nil)